backend/load-tests/critical-flow.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak traffic"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Health Check Baseline"
    weight: 10
    flow:
      - get:
          url: "/health"

  - name: "Browse Shops Flow"
    weight: 40
    flow:
      - get:
          url: "/api/v1/shops"
      - think: 2
      - get:
          url: "/api/v1/zones"
      - think: 1
      - get:
          url: "/api/v1/feed"

  - name: "Community Feed Load"
    weight: 30
    flow:
      - get:
          url: "/api/v1/feed"
      - think: 3
      - get:
          url: "/api/v1/events"

  - name: "API Endpoint Sweep"
    weight: 20
    flow:
      - get:
          url: "/api/v1/zones"
      - think: 1
      - get:
          url: "/api/v1/shops"
      - think: 1
      - get:
          url: "/health"